$(function(){
	var od = $("#openid").val();
  	if(od==""||od==null||od=="null"||typeof(od)=="undefined"){
  		findCode();
  	}
	var d = new Date();
	var nowYear = d.getFullYear();
	var len = nowYear*1 - 1917*1;
	var html = "";
	html = "<option value=''>请选择</option>";
	for ( var i = 0; i <= len; i++) {
		html += '<option value="'+(nowYear*1-i*1)+'">'+(nowYear*1-i*1)+'年</option>';
	}
	$("#enroltime").html(html);
	var mHtml = "";
	var major = ["A-安全工程(本科生)","A-安全工程(研究生)","A-安全科学与工程(研究生)","C-材料成型及控制工程(本科生)","C-材料工程(研究生)","C-材料加工工程(研究生)","C-材料科学与工程(本科生)","C-材料物理(本科生)","C-材料物理与化学(研究生)","C-材料学(研究生)","C-采矿工程(本科生)","C-采矿工程(研究生)","C-测控技术与仪器(本科生)","C-产品设计(本科生)","C-车辆工程(本科生)","C-车辆工程(研究生)","C-城市规划(本科生)","C-城市规划(研究生)","C-城乡规划(本科生)","C-城乡规划学(研究生)","D-地下工程建筑(本科生)","D-电气工程(研究生)","D-电气工程及其自动化(本科生)","D-电子信息工程(本科生)","D-电子信息科学与技术(本科生)","D-电子与通信工程(研究生)","D-雕塑(本科生)","D-对外汉语(本科生)","F-法学(本科生)","F-防灾减灾工程及防护工程(研究生)","F-房地产经管管理(本科生)","F-风景园林(本科生)","F-风景园林(研究生)","F-风景园林学(研究生)","G-钢结构材料与工程(研究生)","G-钢铁压力加工(本科生)","G-钢铁冶金(本科生)","G-钢铁冶金(研究生)","G-给排水科学与工程(本科生)","G-给水排水(本科生)","G-给水排水工程(本科生)","G-工程管理(本科生)","G-工程管理(研究生)","G-工程机械(本科生)","G-工程经济与管理(研究生)","G-工程力学(本科生)","G-工程物理(本科生)","G-工商管理(本科生)","G-工商管理(MBA)","G-工业电气自动化(本科生)","G-工业工程(研究生)","G-工业企业自动化(本科生)","G-工业设计(本科生)","G-工业设计工程(研究生)","G-工业与民用建筑(本科生)","G-工业与民用建筑结构(本科生)","G-工业运输(本科生)","G-工业自动化(本科生)","G-公共事业管理(本科生)","G-功能材料(本科生)","G-供热、供燃气、通风及空调工程(研究生)","G-供热煤气与通风(本科生)","G-供热通风与空调工程(本科生)","G-管理工程(本科生)","G-管理科学(本科生)","G-管理系统工程(研究生)","G-管理哲学(研究生)","G-广播电视编导(本科生)","G-硅酸盐工程(本科生)","G-国际经济与贸易(本科生)","G-国际贸易(本科生)","H-汉语国际教育(本科生)","H-汉语国际教育(研究生)","H-汉语言文学(本科生)","H-化学工程(研究生)","H-化学工程与工艺(本科生)","H-化学工程与技术(研究生)","H-化学工艺(研究生)","H-环境工程(本科生)","H-环境工程(研究生)","H-环境科学(本科生)","H-环境科学与工程(研究生)","H-环境设计(本科生)","H-环境艺术(本科生)","H-环境与资源保护法学(研究生)","H-会计学(本科生)","H-会展艺术与技术(本科生)","H-绘画(本科生)","H-混凝土及建筑制品工艺(本科生)","J-机械电子工程(本科生)","J-机械电子工程(研究生)","J-机械工程(本科生)","J-机械工程(研究生)","J-机械设计及理论(研究生)","J-机械设计及制造(本科生)","J-机械设计制造及其自动化(本科生)","J-机械制造及其自动化(研究生)","J-计算机及应用(本科生)","J-计算机技术(研究生)","J-计算机科学与技术(本科生)","J-计算机数学及其应用软件(本科生)","J-计算机系统结构(研究生)","J-计算机应用技术(研究生)","J-计算数学及其应用软件(本科生)","J-技术经济及管理(研究生)","J-检测技术与自动化装置(研究生)","J-建筑材料(研究生)","J-建筑电气与智能化(本科生)","J-建筑工程(本科生)","J-建筑工业经济与组织(本科生)","J-建筑管理工程(本科生)","J-建筑环境与能源应用工程(本科生)","J-建筑环境与设备工程(本科生)","J-建筑机械(本科生)","J-建筑学(本科生)","J-建筑学(研究生)","J-建筑与土木工程(研究生)","J-建筑智能信息技术(研究生)","J-交通工程(本科生)","J-交通运输(本科生)","J-交通运输工程(研究生)","J-结构工程(研究生)","J-金属材料工程(本科生)","J-金属材料冶金制备科学与工程(研究生)","J-金属学及热处理(本科生)","J-金属压力加工(本科生)","J-经济法(本科生)","J-景观学(本科生)","K-会计学(研究生)","K-控制工程(研究生)","K-控制理论与控制工程(研究生)","K-矿井建设(本科生)","K-矿山地质测量(本科生)","K-矿山机电(本科生)","K-矿山机械(本科生)","K-矿物加工工程(本科生)","K-矿物加工工程(研究生)","K-矿物资源工程(本科生)","K-矿业工程(研究生)","K-矿业机械(本科生)","L-老年工程与老年保障(研究生)","L-力学(研究生)","L-历史建筑保护工程(本科生)","L-炼钢(本科生)","L-炼铁(本科生)","M-马克思主义基本原理(研究生)","M-美术学(研究生)","M-美学(研究生)","M-模式识别与智能系统(研究生)","N-耐火材料(本科生)","Q-企业管理(研究生)","Q-起重运输与工程机械(本科生)","Q-汽车电子与电气(研究生)","Q-桥梁与隧道工程(研究生)","R-软件工程(本科生)","R-软件工程(研究生)","S-设备与工程管理(本科生)","S-设计艺术学(研究生)","S-社会管理(研究生)","S-社会体育(本科生)","S-社会体育指导与管理(本科生)","S-摄影(本科生)","S-市政工程(研究生)","S-视觉传达设计(本科生)","S-数学(研究生)","S-数学与应用数学(本科生)","S-水泥(本科生)","S-思想政治教育(研究生)","T-体育建筑管理(研究生)","T-通信工程(本科生)","T-土地资源管理(研究生)","T-土木工程(本科生)","T-土木工程建造与管理(研究生)","W-文化产业管理(本科生)","W-文化产业管理(研究生)","W-无机非金属材料(本科生)","W-无机非金属材料工程(本科生)","W-无线电技术(本科生)","W-物理学(研究生)","W-物流工程(研究生)","X-行政管理(研究生)","X-戏剧戏曲学(研究生)","X-戏剧影视文学(本科生)","X-戏剧与影视学(研究生)","X-系统工程(本科生)","X-系统工程(研究生)","X-现代结构理论(研究生)","X-项目管理(研究生)","X-信号与信息处理(研究生)","X-信息管理与信息系统(本科生)","X-信息管理与信息系统(研究生)","X-信息与计算科学(本科生)","X-选矿(本科生)","Y-岩土工程(研究生)","Y-冶金工程(本科生)","Y-冶金工程(研究生)","Y-冶金机械(本科生)","Y-冶金热能工程(研究生)","Y-冶金物理化学(本科生)","Y-冶金物理化学(研究生)","Y-艺术设计(本科生)","Y-艺术设计(研究生)","Y-艺术与科技(本科生)","Y-英语(本科生)","Y-应用化学(本科生)","Y-应用数学(本科生)","Y-应用物理学(本科生)","Y-有色金属压力加工(本科生)","Y-有色金属冶金(本科生)","Y-有色金属冶金(研究生)","Y-轧钢(本科生)","Z-哲学(研究生)","Z-职业技术教育学(研究生)","Z-智能建筑(研究生)","Z-中国经济发展研究(研究生)","Z-中国特色政府治理理论(研究生)","Z-资产评估(研究生)","Z-资源循环科学与工程(本科生)","Z-资源循环科学与工程(研究生)","Z-自动化(本科生)","Z-自动学与运动学(本科生)","Z-总图设计于运输工程(本科生)","Z-总图设计与工业运输(本科生)","Z-总图设计与运输(本科生)"];
	mHtml = "<option value=''>请选择</option>";
	for ( var i = 0; i < major.length; i++) {
		mHtml += '<option value="'+major[i]+'">'+major[i]+'</option>';
	}
	mHtml += "<option value='其他'>其他</option>";
	$("#major").html(mHtml);
	var dHtml = "";
	var department = ["建筑学院","土木工程学院","环境与市政工程学院","管理学院","信息与控制工程学院","机电工程学院","冶金工程学院","材料与矿资学院","理学院","文学院","艺术学院","思想政治理论教学研究院","体育系","继续教育学院、职业技术学院","财务处","草堂校区管委会","产业集团","档案馆","发展规划处、高教研究所","附属小学","附属幼儿园","附属中学","公安处","国际交流合作处 港澳台办公室","国资处","后勤服务中心","基础教育处","纪律检查委员会","监察处","建设工程指挥部","教师发展中心","教务处","教育行政学院","科技处","离休干部办公室","人事处","审计处","实验室与设备管理处","统战部","图书馆","退休职工办公室","武装部","校董校友会（教育基金会）","校工会","校团委","校医院","校长办公室","信息网络中心、教育技术中心","幸福校区管委会","宣传部","学报编辑部","学科办","学生工作（部）处","研究生工作部、研究生院","院士办公室","总务处","组织部"];
	dHtml = "<option value=''>请选择</option>";
	for ( var i = 0; i < department.length; i++) {
		dHtml += '<option value="'+department[i]+'">'+department[i]+'</option>';
	}
	dHtml += "<option value='其他'>其他</option>";
	$("#department").html(dHtml);
	
	$("#totalFee").bind("change",function(){
		if($(this).val()==0){
			$("#feeDiv").removeClass("hide");
			$("#feeDiv").addClass("show");
		}else{
			$("#feeDiv").addClass("hide");
			$("#feeDiv").removeClass("show");
		}
	});
});
window.onload = function() {
	$(".summit").bind("click",function() {
		
		var total_fee = $("#totalFee").val();
		var paytype = "0";
		if(total_fee == "0"){
			paytype = "1";
			total_fee = $("#total_fee").val();
		}
		var usertype = $("#usertype").val();
		var major = "";
		var enroltime = "";
		var department = "";
		var door = "";
		if(usertype=="0"){
			major = $("#major").val();
			enroltime = $("#enroltime").val();
		}else if(usertype=="1"){
			department = $("#department").val();
			door = $("#door").val();
		}
		var re = /^[0-9]*[1-9][0-9]*$/;
		var re1 = /^[1][3,4,5,8][0-9]{9}$/;
		if (!re.test(total_fee)) {
			alert("请输入整数！");
			return false;
		}else if ($("#phone").val()!=""&&!re1.test($("#phone").val())) {
			alert("请输入正确的手机号码！");
			return false;
		}else{
			loading_Waiting();
			$.ajax({
				type : "POST",
				url : "../../weChatPayController.do?findPackages",
				dataType : "json",
				traditional : true,
				async : false,
				contentType : 'application/x-www-form-urlencoded;charset=UTF-8',
				data : {
					"t" : new Date(),
					"itemname":$("#itemname").val(),
					"usertype":usertype,
					"name":$("#name").val(),
					"phone":$("#phone").val(),
					"major":major,
					"enroltime":enroltime,
					"department":department,
					"door":door,
					"wish":$("#wish").val(),
					"total_fee":total_fee,
					"paytype":paytype,
					"openid":$("#openid").val(),
					"nickname":$("#nickname").val(),
					"headimg":$("#headimg").val(),
					"donatetype":"0"
				},
				beforeSend : function(XMLHttpRequest) {
					// alert('远程调用开始...');
					$("#loading").show();
				},
				success : function(data) {
					loading_cancal();
					onBridgeReady(data);
				}
			});
		}
	});
};
function findCode(){
	loading_Waiting();
	$.ajax({
		type : "POST",
		url : "../../weChatPayController.do?getCodeRequest",
		dataType : "json",
		traditional :true,
		async: false,
		data:{
			"type" : "1",
		},
		beforeSend:function(XMLHttpRequest){ 
          //alert('远程调用开始...'); 
          $("#loading").show(); 
        }, 
		success : function(data){
			loading_cancal();
			location.href = data;
    	}
	});
}
